import 'package:tech_blog/gen/assets.gen.dart';
import 'package:tech_blog/models/data_models.dart';

Map mainPageTopBannerMap = {
  "imageAsset": Assets.images.topbanner.path,
  "writer": "رضا جوان",
  "date": "یک روز پیش",
  "title": "دوازده قدم برنامه نویسی یک دوره",
  "view": "251"
};

List<HashTag> tagList = [
  HashTag(title: "Flutter"),
  HashTag(title: "جاوا"),
  HashTag(title: "php"),
  HashTag(title: "هوش مصنوعی"),
  HashTag(title: "دارت"),
  HashTag(title: "وب"),
  HashTag(title: "برنامه نویسی"),
];

List<HashTag> tagSelectedList = [];

List<BlogModel> blogList = [
  BlogModel(
      id: 1,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/c363ae23a2_599a1c1defc80f581ebc68eaf71e0375_thumb.jpg",
      title: "ماک چیست؟ مقایسه بهترین آزمون ماک آیلتس در ایران",
      writer: "رضا جوان",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "1 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
  BlogModel(
      id: 2,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/7ae215184c_cbedaef229fc1a0037957f90ae47361b.jpg",
      title: "ماک چیست؟ مقایسه بهترین آزمون ماک آیلتس در ایران",
      writer: "علی احمدی",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "2 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
  BlogModel(
      id: 3,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/ef0e77ece8_9b0e6b7af5dbd708ef8b6b306d418fd6_thumb.jpg",
      title: "ماک چیست؟ مقایسه بهترین آزمون ماک آیلتس",
      writer: "محمدجواد",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "1 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
  BlogModel(
      id: 4,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/abf858ac6c_d604192d072a1feec7a4a272202254f2_thumb.jpg",
      title: "ماک چیست؟ مقایسه بهترین آزمون ماک آیلتس",
      writer: "سعید",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "1 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
];

List<PodcastModel> podcastList = [
  PodcastModel(
      id: 1,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/0e32de4611_35964f47bd094243b08c9eb00e774925.jpg",
      title: "یه روز خوب میاد",
      writer: "احسان",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "1 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
  PodcastModel(
      id: 2,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/e2f27975d4_bbdca91dee46cfb825edd2c63447c941.jpg",
      title: "تست صدای خواننده",
      writer: "علی",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "2 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
  PodcastModel(
      id: 3,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/4462439e0a_55fd322c104a18936640bbb0eb17565e.jpg",
      title: "ماک چیست؟ مقایسه بهترین آزمون ماک آیلتس",
      writer: "محمدجواد",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "1 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
  PodcastModel(
      id: 4,
      imageUrl:
          "https://cdnmrtehran.ir/media/mp3s/01/abf858ac6c_d604192d072a1feec7a4a272202254f2_thumb.jpg",
      title: "ماک چیست؟ مقایسه بهترین آزمون ماک آیلتس",
      writer: "سعید",
      writerImageUrl:
          "https://files.virgool.io/upload/users/53502/avatar…HR.png?x-img=v1/resize,h_120,w_120/optimize,q_100",
      date: "1 ماه پیش",
      content: """
ماک آیلتس چیست؟
ماک آیلتس یه آزمون آزمایشی آیلتسه که توسط موسسه های مختلف برگزار میشه و هدفش اینه که شما خودتون رو بدون اینکه هزینه گزاف آزمون اصلی رو بدین بسنجین. هر موسسه ای سعی میکنه به نوبه خودش تا جایی که میتونه آزمون ماک رو شبیه به آزمون اصلی کنه و تلاش بعضی هاشون هم هرچند ناموفقه ولی قابل تحسینه.

من خودم ۵ - ۶ تا ازمون ماک دادم قبل از ازمون اصلی. نمره ماک اولم شد ۶ و ماک اخرم شد ۷.۵ و آزمون اصلی رو هم که ۸ شدم. فاصله ماک اول تا اخر نزدیک ۴ ماه بود و قطعا من تو ۴ ماه زبانم به اندازه ۲ نمره آیلتس بهتر نشده بود فقط نحوه آزمون دادن رو یاد گرفته بودم. اگه نحوه آزمون دادن رو بلد نیستین برین نوشته های قبلی رو بخونین.
""",
      views: "36353"),
];
